[
  {
    "id": "1oag7gg",
    "title": "Late night thoughts on $HIMS. Up to 3,800 shares",
    "flair": "Discussion",
    "text": "Late night thoughts on $HIMS. Up to 3,800 shares Good night. Morning to some, night to myself.\n\nI haven't shared much recently, but I thought I'd start sharing a bit more, who knows maybe get some good feedback or told to go back into my hiding hole.\n\nSo I'll share some of the latest on what I've been up to—though some of you might not care—like the fact that we reloaded on HIMS this week. My total share count is now 3,800 shares, worth a bit under 200 grand. Right now, I'm only doing share purchases because of how wildly this thing moves. Overall, I’ll keep my thoughts “due diligence” short, not diving into too many numbers, but it's clear this is a company that will continue to grow. For those between 18 and 30, we tend not to be very old school. We don't go to doctors or get our prescriptions ourselves, let alone pick them up. It's mostly just easy to do online. “Not my situation” but if someones piecer down there isn’t working properly, they don't want to see a doctor—just order some pills online. If I'm a little chubby, I can order a medication. If I'm losing hair, I can buy shampoo or hair growth tools online. That's the main story here.\n\nI don’t want to compare it too much to other stocks, but similar to Robinhood, as companies grow and appeal to this demographic, they add new features in a relatively short period of time. Robinhood, for example, recently introduced integrated sports betting or event contract trading, as they call it to sound a bit less degenarte, and similar things happen on HIMS. We don’t go more than a month without getting news about new treatments—either on the HERS side or the HIMS side. I believe this trend will continue, with the company gaining market share and expanding.\n\nFor people familiar with HIMS, I think they're the leader in this space. Looking at my close friends, I'd say seven out of ten use a HIMS product. Maybe we're all just balding, or maybe they just have a great product or service. Overall, I see this as a growth story. It’ll continue expanding and getting bigger. The branding looks good, the interface is nice and user-friendly, and the overall outlook is positive. I currently have $200,000 invested, and I want to grow that to over half a million to start playing some options. If the price dips to around $40, I'll buy some call options, either six months or a year out.\n\nhttps://preview.redd.it/y2x5dolcuzvf1.png?width=2130&format=png&auto=webp&s=a41f4de5b13e8e5cfa4e03cea78db9b33d14da37",
    "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1oag7gg/late_night_thoughts_on_hims_up_to_3800_shares/",
    "score": 4,
    "num_comments": 6
  },
  {
    "id": "1oabbdv",
    "title": "Did I win?",
    "flair": "Gain",
    "text": "Did I win? Did I done do good?",
    "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1oabbdv/did_i_win/",
    "score": 46,
    "num_comments": 29
  },
  {
    "id": "1oa7t4l",
    "title": "RDDT stock, I keep buying on dips but dip keeps dipping. Target price $300 next year they say",
    "flair": "Discussion",
    "text": "RDDT stock, I keep buying on dips but dip keeps dipping. Target price $300 next year they say I think it may go to $300 (source: my feeling lol)  but I am not sure. Have done 0 due diligence. It’s just that I like the product and use it daily. Feel free to share your bull or bear thesis with me here.",
    "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1oa7t4l/rddt_stock_i_keep_buying_on_dips_but_dip_keeps/",
    "score": 428,
    "num_comments": 302
  },
  {
    "id": "1oa6c9b",
    "title": "Buying dip on Silver gone wrong, Still holding",
    "flair": "YOLO",
    "text": "Buying dip on Silver gone wrong, Still holding I thought I caught the bottom on friday when SLV was down $1 but the dip kept dipping and Im down alot on my positions, hoping It goes up monday so I can atleast breakeven🤡",
    "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1oa6c9b/buying_dip_on_silver_gone_wrong_still_holding/",
    "score": 116,
    "num_comments": 119
  },
  {
    "id": "1oa49h5",
    "title": "YOLO $346K in MU",
    "flair": "YOLO",
    "text": "YOLO $346K in MU Y",
    "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1oa49h5/yolo_346k_in_mu/",
    "score": 52,
    "num_comments": 12
  },
  {
    "id": "1o9z4kj",
    "title": "Losing Trader Turns it Around?",
    "flair": "Gain",
    "text": "Losing Trader Turns it Around? It's been a good few months boys,  Struggled for years against gambling tendencies and poor strategy. Learning how to take losses and maintain conviction in strong plays.\n\nGot pretty lucky on the boost a few months ago, but feeling confident to maintain this momentum.",
    "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1o9z4kj/losing_trader_turns_it_around/",
    "score": 234,
    "num_comments": 94
  },
  {
    "id": "1o9ufui",
    "title": "TSLL: I bought the dip",
    "flair": "Gain",
    "text": "TSLL: I bought the dip Now just writing cc.",
    "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1o9ufui/tsll_i_bought_the_dip/",
    "score": 108,
    "num_comments": 42
  },
  {
    "id": "1o9t0wm",
    "title": "TSMC Earnings loss",
    "flair": "Loss",
    "text": "TSMC Earnings loss I saw a dip leading up into earnings and bought 5 of these 300c weeklies, rode the runup before earnings and sold the contacts for a profit right before market close on the day of TSMC earnings. When I sold them I figured earnings were priced in, and was happy to take a profit and minimize risk.\n\nThen Thursday morning after earnings, I did the most impulsive retard thing and I re entered the position at market open after seeing the incredible earnings, and seeing that the contracts I had just sold were trading for less than I had sold them for. The price then dropped and I did something even more retarded, I doubled and tripled down on the position throughout the day Thursday. On Friday at close, Robinhood couldn't even liquidate the contacts at 0.01 each, so you can see a couple actually expired worthless. \n\nFeeling kind of retarded now.",
    "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1o9t0wm/tsmc_earnings_loss/",
    "score": 63,
    "num_comments": 52
  },
  {
    "id": "1o9palp",
    "title": "CAN 50k bet",
    "flair": "YOLO",
    "text": "CAN 50k bet Riding this puppy up for a while longer. I think it’s undervalued.",
    "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1o9palp/can_50k_bet/",
    "score": 25,
    "num_comments": 15
  },
  {
    "id": "1o9j954",
    "title": "MVST - Q3 Earnings November 10th YOLO",
    "flair": "YOLO",
    "text": "MVST - Q3 Earnings November 10th YOLO blocking fidelity, reddit, & stocks until November 10th. I've done my due diligence & am content with the risk. Set a reminder to check in with me on November 10th.",
    "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1o9j954/mvst_q3_earnings_november_10th_yolo/",
    "score": 47,
    "num_comments": 14
  },
  {
    "id": "1o9hin7",
    "title": "How to not panic sell and hold on to your conviction",
    "flair": "Discussion",
    "text": "How to not panic sell and hold on to your conviction I would have made 20-30% profit if kept the position open till today  \n  \nRather I panicked and sold on the same day",
    "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1o9hin7/how_to_not_panic_sell_and_hold_on_to_your/",
    "score": 84,
    "num_comments": 92
  },
  {
    "id": "1o9he1d",
    "title": "It’s a bold strategy Cotton",
    "flair": "YOLO",
    "text": "It’s a bold strategy Cotton",
    "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1o9he1d/its_a_bold_strategy_cotton/",
    "score": 34,
    "num_comments": 33
  },
  {
    "id": "1o9gess",
    "title": "47K% gain",
    "flair": "Gain",
    "text": "47K% gain I seen a lot of monthly and weekly gains so let me show mine",
    "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1o9gess/47k_gain/",
    "score": 779,
    "num_comments": 165
  },
  {
    "id": "1o9g3ig",
    "title": "Had ten of these calls but sold some to fix my car at the time.",
    "flair": "Loss",
    "text": "Had ten of these calls but sold some to fix my car at the time. This counts as loss because I sold this instead of using a credit card and I punch myself every day for paper handing",
    "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1o9g3ig/had_ten_of_these_calls_but_sold_some_to_fix_my/",
    "score": 17,
    "num_comments": 20
  },
  {
    "id": "1o9fn5a",
    "title": "I am not a virgin anymore",
    "flair": "Discussion",
    "text": "I am not a virgin anymore https://preview.redd.it/x967wtyrzqvf1.png?width=1302&format=png&auto=webp&s=4c327934fe4864abd478e97eda287706b537ef46\n\nI apologize in advance for having to use a translator to post this.\n\n\n\nI suffered my first major loss in years of trading. I always knew betting on a piece of crap like the 2X Inverse was foolish. However, after seeing Rigetti's absurd P/S and option ratios, I sold my Google stock, which had been generating steady profits for months, and combined the money I had with my cash to bet on the Rigetti Inverse for the first time in my life, with 2X leverage. Beginner's luck wasn't on my side. The result was -15%.\n\nOf course, from an accounting standpoint, today's trade was a $3,000 profit, but for me, it was a painful loss exceeding -$4,600. I broke my principles and did something foolish. I lost the expected return on the Google stock I bought at a good price, and I destroyed all the small savings I'd always saved.\n\nThe trading experience was horrific. I truly experienced firsthand what Warren Buffett meant when he said, \"Risk is pain.\" When I sold off my Google stock, which had been generating steady profits, and placed a buy order on the 2X inverse, as if I were betting on a hand of cards at a casino, I was already shaking and my heart rate was soaring. I bought right in the early premarket, which was essentially a buy at the peak, and it was a huge burden and pain for me.\n\nBecause the US stock market is like dawn in Korea, I couldn't sleep a wink all night and suffered from tremendous mental and 'physical pain' all night. It was truly astonishing how stress can have such a profound effect on the human body.\n\nI know there are many people here who have lost far, far more than I have.\n\nBut I'm writing this to share with you the lessons I learned from this agonizing night.\n\n\n\nDon't gamble, invest.\n\n  \nSincerely, Lee.",
    "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1o9fn5a/i_am_not_a_virgin_anymore/",
    "score": 437,
    "num_comments": 125
  },
  {
    "id": "1o9fgem",
    "title": "MU to the moon",
    "flair": "Gain",
    "text": "MU to the moon Bought 5 cons at .7 back in July. Sold 2 for $5, 1 at $7 and another at $10. The runner is running",
    "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1o9fgem/mu_to_the_moon/",
    "score": 30,
    "num_comments": 5
  },
  {
    "id": "1o9f4an",
    "title": "From 220% profit to -98% in a Single Day",
    "flair": "Loss",
    "text": "From 220% profit to -98% in a Single Day Before I added the money, I reached a brief moment of 220% profit and was delighted. Desperately added $3700 to water down the damage, but ended up losing it all. I guess I need to get a personal loan to gamble now.",
    "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1o9f4an/from_220_profit_to_98_in_a_single_day/",
    "score": 1497,
    "num_comments": 304
  },
  {
    "id": "1o9d492",
    "title": "Small gains to bring it back",
    "flair": "Gain",
    "text": "Small gains to bring it back",
    "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1o9d492/small_gains_to_bring_it_back/",
    "score": 13,
    "num_comments": 3
  },
  {
    "id": "1o9cz7p",
    "title": "$GAP - Position update, added ~1.5mil of shares & leaps",
    "flair": "YOLO",
    "text": "$GAP - Position update, added ~1.5mil of shares & leaps I averaged down into my $GAP position quite hard during the dip. I diamond hands my calls through a 70% drawdown. Was staring at a \\~800k unrealized loss last week between everything. Always keep enough powder to average down. My investment style is high risk and not suitable for most investors.\n\nGoodluck chat -- how do you play poker?",
    "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1o9cz7p/gap_position_update_added_15mil_of_shares_leaps/",
    "score": 88,
    "num_comments": 84
  },
  {
    "id": "1o9cuzf",
    "title": "AMD / OCT 31",
    "flair": "YOLO",
    "text": "AMD / OCT 31 LISA. SU. 🤌",
    "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1o9cuzf/amd_oct_31/",
    "score": 32,
    "num_comments": 32
  },
  {
    "id": "1o9csr3",
    "title": "Took a screenshot so I had to sell.",
    "flair": "Gain",
    "text": "Took a screenshot so I had to sell. Just going to cool off for a while. Maybe figure out my tax strategy.",
    "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1o9csr3/took_a_screenshot_so_i_had_to_sell/",
    "score": 1369,
    "num_comments": 75
  },
  {
    "id": "1o9cjgz",
    "title": "HIMS pre earnings run up?",
    "flair": "DD",
    "text": "HIMS pre earnings run up? Pre earnings run up?\n\nHi everyone. Do you think we get a pre earnings run up after todays drop?\n\nTodays big sell I see as an over exasperation from good news in the previous weeks of the company expanding into other markets to protect its self from its weight loss drug revenue potentionally decreasing. \n\nToday and yesterdays selling seems to be from bots taking trumps comment and running with it and then taking headlines of the CEO selling stock which was already scheduled as another point to just push it lower.\n\nIt will be interesting to see next weeks play as I think we could re bound to mid 50s again and potentionally test $60 before earnings.\n\nLet me know your thoughts! \n\nI tossed 17k into calls today expiring in two weeks on this thought process",
    "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1o9cjgz/hims_pre_earnings_run_up/",
    "score": 8,
    "num_comments": 12
  },
  {
    "id": "1o9ch8x",
    "title": "No more Health Savings Account",
    "flair": "Loss",
    "text": "No more Health Savings Account Unless there is big news over the weekend that absolutely dumps the market (Probably not). #itsover",
    "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1o9ch8x/no_more_health_savings_account/",
    "score": 250,
    "num_comments": 120
  },
  {
    "id": "1o9ce7c",
    "title": "SPY 0dte game isn't working out for me",
    "flair": "Loss",
    "text": "SPY 0dte game isn't working out for me Idk how you all make money doing this, I keep \"buying the dip\" and consistently lose money. I need to try my luck at a different game in this casino. 1 month returns on SPY 0 and 1 DTE is -10k. 😭\n\nPerhaps I just picked the wrong month to play?",
    "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1o9ce7c/spy_0dte_game_isnt_working_out_for_me/",
    "score": 39,
    "num_comments": 52
  },
  {
    "id": "1o9c3ht",
    "title": "What a roller coaster",
    "flair": "Gain",
    "text": "What a roller coaster Starting again with only 5k from next week!",
    "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1o9c3ht/what_a_roller_coaster/",
    "score": 63,
    "num_comments": 35
  },
  {
    "id": "1o9bubf",
    "title": "$380K Yolo on CAN",
    "flair": "YOLO",
    "text": "$380K Yolo on CAN Positions attached, tl;dr they sell bitcoin mining machines. ChatGPT’d about the company their financials didn’t look bad.\n\nIf I get removed because sub 1B mcap I apologize in advance to the mods, I haven’t posted a thread on here in forever and normally just talk in weekend posts/lurk. If anyone wants the chatgpt’d information lmk I’ll happily attach it.",
    "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1o9bubf/380k_yolo_on_can/",
    "score": 15,
    "num_comments": 23
  },
  {
    "id": "1o9asab",
    "title": "Door Dash & Waymo Partner",
    "flair": "News",
    "text": "Door Dash & Waymo Partner Bullish - see lots of upside for DoorDash reducing their overhead if this becomes widespread. \n\nDoorDash and Waymo launch autonomous delivery service and introduce limited-time Waymo promotion for DashPass members | DoorDash https://share.google/i4BAS54y7qfiva10n",
    "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1o9asab/door_dash_waymo_partner/",
    "score": 43,
    "num_comments": 39
  },
  {
    "id": "1o9afka",
    "title": "$GAP It was fun while it lasted",
    "flair": "Gain",
    "text": "$GAP It was fun while it lasted Reposting to get rid of personal notification at the top cuz I'm a regard.\n\nBut yeah, again, apparently gap is going up due to increased call activity and higher IV.\n\nI'm paperhanding cuz of US-China tension, maybe it's a genius move, maybe not. Looking forward to other people posting their gains/losses\n\nNot a financial blah blah blah do your own blah blah blah.\n\nEDIT: Typo cuz I'm a regard",
    "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1o9afka/gap_it_was_fun_while_it_lasted/",
    "score": 26,
    "num_comments": 24
  },
  {
    "id": "1o991tm",
    "title": "Unlimited buying power play",
    "flair": "Discussion",
    "text": "Unlimited buying power play Trade:\n\nBuy $OPEN for $7\n\nSell 2028 $20 strike call for $3.5\n\nBroker gives you $3.5 of margin on top of the $3.5 credit you receive\n\nOpendoor moons, max gain $23.5, or 4x\n\nOpendoor tanks, cost basis $3.5\n\nOpendoor stays same price, free 50% gain from the $3.5 call going to $0\n\nCan put this trade on with zero opportunity cost since capital is returned immediately. You can also use the returned capital to buy more $OPEN, and sell more calls\n\nNot financial advice 🙏",
    "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1o991tm/unlimited_buying_power_play/",
    "score": 352,
    "num_comments": 90
  },
  {
    "id": "1o98pls",
    "title": "PPTA - Antimony & Gold Miner About to Break Ground",
    "flair": "YOLO",
    "text": "PPTA - Antimony & Gold Miner About to Break Ground I’m not the best at writing these but this was originally a DD but now it’s getting to be a YOLO size in my trading account. I also have 1k shares in my Merrill Edge account.\n\nHere’s the thesis without using AI:\n\n1. Dollar depreciation coming w rate cuts and Powell slowing or stopping QT\n2. Gold rising on point 1\n3. Antimony needs for bullets, and the CEO just said on Fox Business this week they can fully supply the Army’s needs\n4. CEO also said after selling antimony gold retrieval costs will be negative\n5. You know those cool people at the Heritage Foundation? They are on to Antimony and have an article about it: https://www.heritage.org/trade/commentary/critical-mineral-critical-moment-the-antimony-crisis\n6. Look up John Paulson and how much he owns of this stock. If there’s an Orange man connection needed for a government buy-in, it should be here. He also owned some Trilogy Metals which got a buy-in. He owns way more PPTA.\n7. Watch the Fox Business video: https://www.foxbusiness.com/video/6382792160112\n8. It’s down today because gold is down so gold miners are down. I added the calls you see on the drop. Hasn’t popped yet but if I’m right I can link to this thread and feel good about it.\n9. EXIM loan funding should be soon-ish. I think a government buy-in could happen before or at the same time before they start rerating: https://www.investors.perpetuaresources.com/investors/news/perpetua-resources-announces-prelim-project-letter-exim\n\nI think this is a good stock, not financial advice.",
    "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1o98pls/ppta_antimony_gold_miner_about_to_break_ground/",
    "score": 15,
    "num_comments": 23
  },
  {
    "id": "1o98f4i",
    "title": "AIRO Group & Bullet Sign LOI Form Joint Venture Advancing Ukraine-Developed Interceptor Drones for U.S. and NATO Defense Market",
    "flair": "News",
    "text": "AIRO Group & Bullet Sign LOI Form Joint Venture Advancing Ukraine-Developed Interceptor Drones for U.S. and NATO Defense Market",
    "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1o98f4i/airo_group_bullet_sign_loi_form_joint_venture/",
    "score": 11,
    "num_comments": 1
  },
  {
    "id": "1o97ttg",
    "title": "Took a break for a few years, but we're back on the 0dte SPY train",
    "flair": "YOLO",
    "text": "Took a break for a few years, but we're back on the 0dte SPY train Today's trade not included - Pulled $2000 out, now playing with house money\n\nSpy 10/17 660call\n\nOpened 45 at 2.37\n\nClosed 45 at 4.20\n\nAccount up to $19,000 (plus the 2,000 in the bank)\n\nGoing from 500 to 100,000 (or 0)",
    "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1o97ttg/took_a_break_for_a_few_years_but_were_back_on_the/",
    "score": 24,
    "num_comments": 18
  },
  {
    "id": "1o957po",
    "title": "And the called me regard!! RGTI in 4 days!!",
    "flair": "Gain",
    "text": "And the called me regard!! RGTI in 4 days!! It hurts to see people beyond bullish on such risky assets!!",
    "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1o957po/and_the_called_me_regard_rgti_in_4_days/",
    "score": 219,
    "num_comments": 95
  },
  {
    "id": "1o951l7",
    "title": "Bitf Pain",
    "flair": "Discussion",
    "text": "Bitf Pain I had this contract on my watchlist for a while, so when I saw Bitf had a dip I was patient and finally got in. I thought that not only would November 21 be enough, but that I was also buying near the bottom. Well, turns out that was not true at all. \n\nI still have some hope that maybe I can get out of this loosing only around 10k. The 500m note move seems short term enough, they have their earnings on the 12th, and perhaps the sector can have a comeback. Though the current state of things, or more specifically where things might go next, time decay, and holy shit IV is making this hard. \n\nIf I do loose 30k, or maybe a little more I think it’s just a very expensive lesson and I would only be loosing money that I made on the stock market. I hope maybe my losses can make some of you feel better by looking at your own portfolio.",
    "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1o951l7/bitf_pain/",
    "score": 96,
    "num_comments": 45
  },
  {
    "id": "1o94nkl",
    "title": "Cashed out 30k on Tuesday, still out here doing DoorDash and Uber Eats while gambling the rest 40k on 0DTE SPY puts 😅",
    "flair": "Gain",
    "text": "Cashed out 30k on Tuesday, still out here doing DoorDash and Uber Eats while gambling the rest 40k on 0DTE SPY puts 😅 Y’all might catch me at your front door this weekend — don’t forget to tip your favorite Dasher 😎🚗💨",
    "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1o94nkl/cashed_out_30k_on_tuesday_still_out_here_doing/",
    "score": 369,
    "num_comments": 76
  },
  {
    "id": "1o93smy",
    "title": "Am I cooked chat",
    "flair": "Loss",
    "text": "Am I cooked chat",
    "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1o93smy/am_i_cooked_chat/",
    "score": 77,
    "num_comments": 70
  },
  {
    "id": "1o93297",
    "title": "IONQ shareholders plan to sale 25.3M shares ($1.6B in value)",
    "flair": "News",
    "text": "IONQ shareholders plan to sale 25.3M shares ($1.6B in value) Certain existing holders got their shares registered for potential resale. Up to 25,275,276 shares of Company common stock\n\nFORM 8-K\nhttps://www.sec.gov/Archives/edgar/data/1824920/000095014225002827/eh250693365_8k.htm",
    "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1o93297/ionq_shareholders_plan_to_sale_253m_shares_16b_in/",
    "score": 119,
    "num_comments": 38
  },
  {
    "id": "1o92ip1",
    "title": "I guess I should have sold GLD at market open…",
    "flair": "Loss",
    "text": "I guess I should have sold GLD at market open… Was up $6k yesterday, which stressed me out; partly because it’s insane that anyone can even make that much money that fast doing nothing, & partly because I knew it could go as quickly as it came…\n\nI put in stop-losses on all my positions. But, I guess I should have set them higher so I wouldn’t lose so much. Still, I am up a few hundred dollars from yesterday, & doing really well the last few weeks.\n\nI’m going to do what somebody in here recommend yesterday: withdraw the money you’ve made so you realize that it’s not just play money sitting in your Robinhood account, but real money that actually matters. \n\nI hope I have another day like yesterday someday, but actually take the profit immediately. I also need to get better at putting in stop losses at the right price.\n\nWith the kindest regards",
    "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1o92ip1/i_guess_i_should_have_sold_gld_at_market_open/",
    "score": 590,
    "num_comments": 254
  },
  {
    "id": "1o925ag",
    "title": "Can I join the club now",
    "flair": "Loss",
    "text": "Can I join the club now Bought yesterday morning was up for a lil bit lmao, all profits erased from Prot and some",
    "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1o925ag/can_i_join_the_club_now/",
    "score": 117,
    "num_comments": 37
  },
  {
    "id": "1o9191k",
    "title": "This card game would be lit!",
    "flair": "Meme",
    "text": "This card game would be lit!",
    "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1o9191k/this_card_game_would_be_lit/",
    "score": 15236,
    "num_comments": 304
  },
  {
    "id": "1o8z1ka",
    "title": "It's not over just yet",
    "flair": "YOLO",
    "text": "It's not over just yet",
    "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1o8z1ka/its_not_over_just_yet/",
    "score": 215,
    "num_comments": 130
  },
  {
    "id": "1o8x8tv",
    "title": "Daily Discussion Thread for October 17, 2025",
    "flair": "Daily Discussion",
    "text": "Daily Discussion Thread for October 17, 2025 This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/wallstreetbets/comments/1o8x8tv)",
    "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1o8x8tv/daily_discussion_thread_for_october_17_2025/",
    "score": 218,
    "num_comments": 15487
  },
  {
    "id": "1o8wync",
    "title": "Why BTQ can be the best of the other quantum stocks and 10x.",
    "flair": "DD",
    "text": "Why BTQ can be the best of the other quantum stocks and 10x. \nOn Thursday 16, BTQ demonstrated quantum-resistant bitcoin using NIST technology. News link below.\n\nhttps://stocktwits.com/news-articles/markets/equity/btq-technologies-stock-jumps-after-quantum-safe-bitcoin-demonstration/ch6pIqXR3nU\n\nOverall the company focuses in the below immediate industry needs:\n\n1) Addressing an Immediate Need \n\nThe threat of quantum computers breaking current cryptographic systems is more foreseeable than the timeline for full-scale quantum machines. BTQ’s focus on post-quantum cryptography is tackling a pressing demand that organizations (governments, financial institutions, infrastructure) will need before large quantum computers are widely usable. Just imagine if Bitcoin would be encrypted and all crypto market fail this create negative systematic repercussions on the financial system. From a regulatory standpoint this is a priority.\n\n2) Vertical Stack & Differentiation\n\nUnlike many peers that focus purely on hardware or component-level bets, BTQ is building a vertically integrated stack: algorithms, software, hardware-accelerators, toolkits. This gives it the potential to capture value across multiple layers rather than competing on narrow hardware alone.\n\n3) Lower Execution Risk (Relative to Pure Hardware Plays)\n\nHardware quantum machines face immense engineering and scalability challenges. By contrast, cryptographic and algorithmic resilience work is more incremental and aligns more closely with existing compute / security markets. While not zero risk, it’s less of a moonshot compared to some hardware-only plays.\n\nOf course, these upside arguments depend heavily on BTQ executing well, gaining adoption, and navigating dilution; and also on the timeline and competitive dynamics of quantum and cryptographic markets. \n\nBut from a speculative investor’s viewpoint, BTQ offers a differentiated risk/reward profile compared to more conventional pure-quantum-hardware bets.\n\nBTQ has circa $ 1.6bn market cap. The rest of the quantum stocks are valued between $4.8-$27.2B. At par, that’s a 2.5-14x from today’s closing share price - so circa $30-$170USD.\n\nI hold 16792 shares and not selling until $100.",
    "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1o8wync/why_btq_can_be_the_best_of_the_other_quantum/",
    "score": 2,
    "num_comments": 34
  },
  {
    "id": "1o8wdzc",
    "title": "How cooked am I",
    "flair": "Loss",
    "text": "How cooked am I",
    "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1o8wdzc/how_cooked_am_i/",
    "score": 6,
    "num_comments": 35
  },
  {
    "id": "1o8tpd3",
    "title": "Tell me it's gonna be okay 🤧😭",
    "flair": "Loss",
    "text": "Tell me it's gonna be okay 🤧😭 The only hedge I have is my job 💩",
    "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1o8tpd3/tell_me_its_gonna_be_okay/",
    "score": 775,
    "num_comments": 317
  },
  {
    "id": "1o8tfco",
    "title": "Looking forward to more gains with the miners.",
    "flair": "Gain",
    "text": "Looking forward to more gains with the miners. \nCurrently holding 40 10/24 GDXJ 115Cs.",
    "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1o8tfco/looking_forward_to_more_gains_with_the_miners/",
    "score": 21,
    "num_comments": 7
  },
  {
    "id": "1o8stri",
    "title": "Market red days. Party's over? Who's YOLOing GLD or /GC?",
    "flair": "Discussion",
    "text": "Market red days. Party's over? Who's YOLOing GLD or /GC? https://preview.redd.it/lxb8n3iywlvf1.png?width=1290&format=png&auto=webp&s=65b8a703effd2739b6e28fead6658c90cc87bc5d\n\nI bought GLD calls mid-day after seeing SPY wildly swinging incoherently and without any apparent reason.\n\nMid-day I gave up on critical minerals sold of all my critical minerals tankers. Started a 1% position on GLD calls. Not a YOLO by a long shot.\n\nWith SPY becoming too volatile triggering panic, my mini-DD is that people are going to buy GLD. \n\nThose who already have GLD are going to look for a profit-taking opportunity. So I would estimate we have maybe tomorrow and early next week before it also crashes in this market.\n\nI'll probably try to scalp some options intraday. \n\nWhat's everyone doing to avoid the across-the-market red days?",
    "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1o8stri/market_red_days_partys_over_whos_yoloing_gld_or_gc/",
    "score": 56,
    "num_comments": 90
  },
  {
    "id": "1o8qbja",
    "title": "ABAT is gonna drop tomorrow at open 10/17 - in for 68k - DD included",
    "flair": "DD",
    "text": "ABAT is gonna drop tomorrow at open 10/17 - in for 68k - DD included Called this one out on premarket chat but - it's gonna rip on open. It's not just a trend trade, there's more to this last few days.\n\nSo - I got the idea for this stock from you guys, someone dropped the SEC 8k filing here.\n\nThat got me looking at it in detail - and the timeline don't make much sense:\n\n* **Sept 1, 2023:** Gets $57.7M DOE grant for lithium project. Stock pumps.\n* **May 15, 2025:** DOE issues memo - all MESC grants getting audited for \"federal stewardship and substantial involvement.\" Translation: where'd you put our fucking money?\n* **Oct 9, 2025:** DOE terminates their grant. Company knows internally.\n* **Oct 13, 2025:** Company releases fluff PR about \"submitting baseline studies\" for regulatory approval. Retail buys the \"good news.\"\n* **Oct 14, 2025:** Board of Directors amends bylaws to make it harder to fire themselves (more on this in a sec)\n* **Oct 15, 2025 @ 5:15 PM:** Finally disclose the grant termination. After hours, stock craters from $8.95 to $5.32 in minutes.\n\nThey sat on material negative news for six days while pumping positive PR.\n\nHere's where it gets spicy. The 8-K says \"as of October 9, 2025 there were approximately $52 million of reimbursable DOE funds remaining.\"\n\nCool cool cool. So where is it?\n\n**June 30, 2025 Balance Sheet:**\n\n* Cash: $7.47M\n* Grants receivable: $244K\n\nThey claim they \"already raised over $52 million of funds from the public markets\" to replace it. But their balance sheet doesn't show it - at least as of last June.\n\n**What they DID spend money on (FY2025):**\n\n* General & Administrative: $21.2M (up 31% YoY)\n* Research & Development: $8.5M (down 41% YoY)\n* Stock-based compensation: $13.9M\n\nThey spent MORE on admin costs and LESS on actual R&D. Revenue? Basically zero. They made $4.3M but had $14.9M cost of goods sold. Negative gross margin of $10.5M.\n\n# The Bylaw Coup\n\nNow here's the really fun part. That Oct 14th bylaw amendment - buried in the same 8-K as the grant loss - isn't just \"clarifications.\" It's a power grab:\n\n**Key changes:**\n\n1. **Director removal threshold:** Increased to TWO-THIRDS of outstanding shares (up from simple majority). They chose the hardest option right before bad news.\n2. **Quorum requirements:** Only need 33.3% present for meetings, but 67% to remove directors. Math doesn't math unless you're trying to make shareholder action impossible.\n3. **Board compensation:** \"Directors shall be entitled to such compensation for their services as may be approved by vote of the Board of Directors.\" They set their own pay.\n4. **Meeting calls:** Board can call meetings by email. Stockholders need 25% of shares AND must deliver written notice.\n\nTranslation: \"We just lost $52M of taxpayer money, so we're making it legally impossible for you to fire us.\"\n\n# The Fake Project\n\nTheir \"Tonopah Flats Lithium Project\" that they've been pushing? Let's read their own technical report:  \n   \n*\"Inferred Mineral Resource - the lowest level of geological confidence of all mineral resources, which prevents the application of the modifying factors in a manner useful for evaluation of economic viability... may not be considered when assessing the economic viability of a mining project.\"*\n\nThey've been drilling since 2021. FOUR YEARS. Still at \"Inferred\" classification. That's the mining equivalent of \"we think there might be lithium here but we're not sure and definitely can't tell you if it's profitable.\"\n\nAnd that Oct 13th PR about \"baseline studies\"? The 8-K explicitly states it \"**shall not be deemed to be 'filed'**\" - it's literally non-actionable PR fluff.\n\n# Why This Goes Lower\n\n1. **No viable business:** Four years, still at Inferred resources, no revenue, burning $10M+ per quarter\n2. **DOE grant loss removes credibility:** If the government won't fund you after auditing your books, why should retail?\n3. **Bylaws amendment attracts scrutiny:** That timing is TOO convenient. Class action lawyers are gonna have a field day.\n4. **Missing money:** $52M raised but only $7.5M in cash? Where'd it go? Salaries and stock comp while making no project progress.\n5. **Dilution death spiral:** They'll need more cash. Only source is more dilution. Stock goes lower. Need more cash. Repeat.\n\nNowww - they still have another grant from December '24 too. If DOE terminated the lithium grant for \"federal stewardship\" issues, what makes you think the recycling grant is safe? They're probably burning that money on salaries too.\n\nAnyways - read through the filings, it's not making much sense. Feels like they keep punting a project that never really gets done with directors fill their pockets with grant after grant.\n\n**Current positions:**\n\n* 500x Oct 17 $5 puts @ $0.10 avg\n* 400x Oct 17 $6 puts @ $0.47 avg\n* 150x Nov 21 $4 puts @ $0.40 avg\n* 180x Nov 21 $5 puts @ $0.85 avg\n* 160x Nov 21 $6 puts @ $1.48 avg\n\nPrice target - we open tomorrow at $4.10 or so (as is - we're already at $4.30 after hours). Next week or two, we drop to $2.50-$3.00 as fraud concerns emerge, maybe lower if SEC announces some investigation.",
    "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1o8qbja/abat_is_gonna_drop_tomorrow_at_open_1017_in_for/",
    "score": 553,
    "num_comments": 238
  },
  {
    "id": "1o8plfa",
    "title": "$RR shares I scooped up today on this beautiful sale. Shorts gonna get wiped out on a single tweet any day now. $10+ by next Friday 🌙",
    "flair": "YOLO",
    "text": "$RR shares I scooped up today on this beautiful sale. Shorts gonna get wiped out on a single tweet any day now. $10+ by next Friday 🌙",
    "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1o8plfa/rr_shares_i_scooped_up_today_on_this_beautiful/",
    "score": 21,
    "num_comments": 40
  },
  {
    "id": "1o8no4a",
    "title": "Nokia",
    "flair": "Gain",
    "text": "Nokia I'm gonna buy a Nokia phone",
    "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1o8no4a/nokia/",
    "score": 24,
    "num_comments": 14
  }
]